Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH064.atdf
         <module id="01423" name="RPIN" version="">
            <instance name="RPIN">
               <register-group address-space="periph_pb1_std" name="RPIN" name-in-module="RPIN" offset="0x1f801404" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02481" name="RPOR" version="">
            <instance name="RPOR">
               <register-group address-space="periph_pb1_std" name="RPOR" name-in-module="RPOR" offset="0x1f801600" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01261" name="RTCC" version="">
            <instance name="RTCC">
               <register-group address-space="periph_pb6_std" name="RTCC" name-in-module="RTCC" offset="0x1f8c0000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="00136" name="SB" version="">
            <instance name="SB">
               <register-group address-space="periph_ssx" name="SB" name-in-module="SB" offset="0x1f8f0510" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="01329" name="SPI" version="">
            <instance name="SPI1">
               <register-group address-space="periph_pb2_std" name="SPI" name-in-module="SPI" offset="0x1f827000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="SPI2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02141" name="TMR1" version="">
            <instance name="TMR1">
               <register-group address-space="periph_pb2_std" name="TMR1" name-in-module="TMR1" offset="0x1f820000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02815" name="TMR" version="">
            <instance name="TMR2">
               <register-group address-space="periph_pb2_std" name="TMR2" name-in-module="TMR2" offset="0x1f820200" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR3">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR4">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR5">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR6">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR7">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR8">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="TMR9">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02478" name="UART" version="">
            <instance name="UART1">
               <register-group address-space="periph_pb2_std" name="UART" name-in-module="UART" offset="0x1f828000" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
            <instance name="UART2">
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
         <module id="02674" name="WDT" version="">
            <instance name="WDT">
               <register-group address-space="periph_pb1_std" name="WDT" name-in-module="WDT" offset="0x1f800c00" />
               <parameters>
                  <param name="" />
               </parameters>
            </instance>
         </module>
      </peripherals>
      <interrupts>
         <interrupt caption="Core Timer Interrupt" index="0" name="CORE_TIMER" />
         <interrupt caption="Core Software Interrupt 0" index="1" name="CORE_SOFTWARE_0" />
         <interrupt caption="Core Software Interrupt 1" index="2" name="CORE_SOFTWARE_1" />
         <interrupt caption="External Interrupt 0" index="3" name="EXTERNAL_0" />
         <interrupt caption="Timer1" index="4" name="TIMER_1" />
         <interrupt caption="Input Capture 1 Error" index="5" name="INPUT_CAPTURE_1_ERROR" />
         <interrupt caption="Input Capture 1" index="6" name="INPUT_CAPTURE_1" />
         <interrupt caption="Output Compare 1" index="7" name="OUTPUT_COMPARE_1" />
         <interrupt caption="External Interrupt 1" index="8" name="EXTERNAL_1" />
         <interrupt caption="Timer2" index="9" name="TIMER_2" />
         <interrupt caption="Input Capture 2 Error" index="10" name="INPUT_CAPTURE_2_ERROR" />
         <interrupt caption="Input Capture 2" index="11" name="INPUT_CAPTURE_2" />
         <interrupt caption="Output Compare 2" index="12" name="OUTPUT_COMPARE_2" />
         <interrupt caption="External Interrupt 2" index="13" name="EXTERNAL_2" />
         <interrupt caption="Timer3" index="14" name="TIMER_3" />
         <interrupt caption="Input Capture 3 Error" index="15" name="INPUT_CAPTURE_3_ERROR" />
         <interrupt caption="Input Capture 3" index="16" name="INPUT_CAPTURE_3" />
         <interrupt caption="Output Compare 3" index="17" name="OUTPUT_COMPARE_3" />
         <interrupt caption="External Interrupt 3" index="18" name="EXTERNAL_3" />
         <interrupt caption="Timer4" index="19" name="TIMER_4" />
         <interrupt caption="Input Capture 4 Error" index="20" name="INPUT_CAPTURE_4_ERROR" />
         <interrupt caption="Input Capture 4" index="21" name="INPUT_CAPTURE_4" />
         <interrupt caption="Output Compare 4" index="22" name="OUTPUT_COMPARE_4" />
         <interrupt caption="External Interrupt 4" index="23" name="EXTERNAL_4" />
         <interrupt caption="Timer5" index="24" name="TIMER_5" />
         <interrupt caption="Input Capture 5 Error" index="25" name="INPUT_CAPTURE_5_ERROR" />
         <interrupt caption="Input Capture 5" index="26" name="INPUT_CAPTURE_5" />
         <interrupt caption="Output Compare 5" index="27" name="OUTPUT_COMPARE_5" />
         <interrupt caption="Real Time Clock" index="30" name="RTCC" />
         <interrupt caption="Flash Control Event" index="31" name="FLASH_CONTROL" />
         <interrupt caption="Comparator 1 Interrupt" index="32" name="COMPARATOR_1" />
         <interrupt caption="Comparator 2 Interrupt" index="33" name="COMPARATOR_2" />
         <interrupt caption="SPI1 Fault" index="35" name="SPI1_FAULT" />
         <interrupt caption="SPI1 Receive Done" index="36" name="SPI1_RX" />
         <interrupt caption="SPI1 Transfer Done" index="37" name="SPI1_TX" />
         <interrupt caption="UART1 Fault" index="38" name="UART1_FAULT" />
         <interrupt caption="UART1 Receive Done" index="39" name="UART1_RX" />
         <interrupt caption="UART1 Transfer Done" index="40" name="UART1_TX" />
         <interrupt caption="I2C1 Bus Collision Event" index="41" name="I2C1_BUS" />
         <interrupt caption="I2C1 Slave Event" index="42" name="I2C1_SLAVE" />
         <interrupt caption="I2C1 Master Event" index="43" name="I2C1_MASTER" />
         <interrupt caption="PORTA Input Change Interrupt" index="44" name="CHANGE_NOTICE_A" />
         <interrupt caption="PORTB Input Change Interrupt" index="45" name="CHANGE_NOTICE_B" />
         <interrupt caption="PORTC Input Change Interrupt" index="46" name="CHANGE_NOTICE_C" />
         <interrupt caption="PORTD Input Change Interrupt" index="47" name="CHANGE_NOTICE_D" />
         <interrupt caption="PORTE Input Change Interrupt" index="48" name="CHANGE_NOTICE_E" />
         <interrupt caption="PORTF Input Change Interrupt" index="49" name="CHANGE_NOTICE_F" />
         <interrupt caption="PORTG Input Change Interrupt" index="50" name="CHANGE_NOTICE_G" />
         <interrupt caption="SPI2 Fault" index="53" name="SPI2_FAULT" />
         <interrupt caption="SPI2 Receive Done" index="54" name="SPI2_RX" />
         <interrupt caption="SPI2 Transfer Done" index="55" name="SPI2_TX" />
         <interrupt caption="UART2 Fault" index="56" name="UART2_FAULT" />
         <interrupt caption="UART2 Receive Done" index="57" name="UART2_RX" />
         <interrupt caption="UART2 Transfer Done" index="58" name="UART2_TX" />
         <interrupt caption="I2C2 Bus Collision Event" index="59" name="I2C2_BUS" />
         <interrupt caption="I2C2 Slave Event" index="60" name="I2C2_SLAVE" />
         <interrupt caption="I2C2 Master Event" index="61" name="I2C2_MASTER" />
         <interrupt caption="CTMU Interrupt" index="71" name="CTMU" />
         <interrupt caption="DMA Channel 0" index="72" name="DMA0" />
         <interrupt caption="DMA Channel 1" index="73" name="DMA1" />
         <interrupt caption="DMA Channel 2" index="74" name="DMA2" />
         <interrupt caption="DMA Channel 3" index="75" name="DMA3" />
         <interrupt caption="Timer6" index="76" name="TIMER_6" />
         <interrupt caption="Input Capture 6 Error" index="77" name="INPUT_CAPTURE_6_ERROR" />
         <interrupt caption="Input Capture 6" index="78" name="INPUT_CAPTURE_6" />
         <interrupt caption="Output Compare 6" index="79" name="OUTPUT_COMPARE_6" />
         <interrupt caption="Timer7" index="80" name="TIMER_7" />
         <interrupt caption="Input Capture 7 Error" index="81" name="INPUT_CAPTURE_7_ERROR" />
         <interrupt caption="Input Capture 7" index="82" name="INPUT_CAPTURE_7" />
         <interrupt caption="Output Compare 7" index="83" name="OUTPUT_COMPARE_7" />
         <interrupt caption="Timer8" index="84" name="TIMER_8" />
         <interrupt caption="Input Capture 8 Error" index="85" name="INPUT_CAPTURE_8_ERROR" />
         <interrupt caption="Input Capture 8" index="86" name="INPUT_CAPTURE_8" />
         <interrupt caption="Output Compare 8" index="87" name="OUTPUT_COMPARE_8" />
         <interrupt caption="Timer9" index="88" name="TIMER_9" />
         <interrupt caption="Input Capture 9 Error" index="89" name="INPUT_CAPTURE_9_ERROR" />
         <interrupt caption="Input Capture 9" index="90" name="INPUT_CAPTURE_9" />
         <interrupt caption="Output Compare 9" index="91" name="OUTPUT_COMPARE_9" />
         <interrupt caption="ADC Global Interrupt" index="92" name="ADC" />
         <interrupt caption="ADC Digital Comparator 1" index="94" name="ADC_DC1" />
         <interrupt caption="ADC Digital Comparator 2" index="95" name="ADC_DC2" />
         <interrupt caption="ADC Digital Filter 1" index="96" name="ADC_DF1" />
         <interrupt caption="ADC Digital Filter 2" index="97" name="ADC_DF2" />
         <interrupt caption="ADC Digital Filter 3" index="98" name="ADC_DF3" />
         <interrupt caption="ADC Digital Filter 4" index="99" name="ADC_DF4" />
         <interrupt caption="ADC Fault" index="100" name="ADC_FAULT" />
         <interrupt caption="ADC End of Scan" index="101" name="ADC_EOS" />
         <interrupt caption="ADC Ready" index="102" name="ADC_ARDY" />
         <interrupt caption="ADC Update Ready After Suspend" index="103" name="ADC_URDY" />
         <interrupt caption="ADC First Class Channels DMA" index="104" name="ADC_DMA" />
         <interrupt caption="ADC Early Group Interrupt" index="105" name="ADC_EARLY" />
         <interrupt caption="ADC Data 0" index="106" name="ADC_DATA0" />
         <interrupt caption="ADC Data 1" index="107" name="ADC_DATA1" />
         <interrupt caption="ADC Data 2" index="108" name="ADC_DATA2" />
         <interrupt caption="ADC Data 3" index="109" name="ADC_DATA3" />
         <interrupt caption="ADC Data 4" index="110" name="ADC_DATA4" />
         <interrupt caption="ADC Data 5" index="111" name="ADC_DATA5" />
         <interrupt caption="ADC Data 6" index="112" name="ADC_DATA6" />
         <interrupt caption="ADC Data 7" index="113" name="ADC_DATA7" />
         <interrupt caption="ADC Data 8" index="114" name="ADC_DATA8" />
         <interrupt caption="ADC Data 9" index="115" name="ADC_DATA9" />
         <interrupt caption="ADC Data 10" index="116" name="ADC_DATA10" />
         <interrupt caption="ADC Data 11" index="117" name="ADC_DATA11" />
         <interrupt caption="ADC Data 12" index="118" name="ADC_DATA12" />
         <interrupt caption="ADC Data 13" index="119" name="ADC_DATA13" />
         <interrupt caption="ADC Data 14" index="120" name="ADC_DATA14" />
         <interrupt caption="ADC Data 15" index="121" name="ADC_DATA15" />
         <interrupt caption="ADC Data 16" index="122" name="ADC_DATA16" />
         <interrupt caption="ADC Data 17" index="123" name="ADC_DATA17" />
         <interrupt caption="ADC Data 18" index="124" name="ADC_DATA18" />
         <interrupt caption="ADC Data 19" index="125" name="ADC_DATA19" />
         <interrupt caption="ADC Data 24" index="130" name="ADC_DATA24" />
         <interrupt caption="ADC Data 25" index="131" name="ADC_DATA25" />
         <interrupt caption="ADC Data 26" index="132" name="ADC_DATA26" />
         <interrupt caption="ADC Data 27" index="133" name="ADC_DATA27" />
         <interrupt caption="ADC Data 40" index="146" name="ADC_DATA40" />
         <interrupt caption="ADC Data 41" index="147" name="ADC_DATA41" />
         <interrupt caption="ADC Data 46" index="152" name="ADC_DATA46" />
         <interrupt caption="ADC Data 47" index="153" name="ADC_DATA47" />
         <interrupt caption="ADC Data 48" index="154" name="ADC_DATA48" />
         <interrupt caption="ADC Data 49" index="155" name="ADC_DATA49" />
         <interrupt caption="ADC Data 50" index="156" name="ADC_DATA50" />
         <interrupt caption="ADC Data 51" index="157" name="ADC_DATA51" />
         <interrupt caption="ADC Data 52" index="158" name="ADC_DATA52" />
         <interrupt caption="ADC Data 53" index="159" name="ADC_DATA53" />
         <interrupt caption="Comparator 3 Interrupt" index="160" name="COMPARATOR_3" />
         <interrupt caption="Comparator 4 Interrupt" index="161" name="COMPARATOR_4" />
         <interrupt caption="Comparator 5 Interrupt" index="162" name="COMPARATOR_5" />
         <interrupt caption="CAN1 Global Interrupt" index="167" name="CAN1" />
         <interrupt caption="QEI 1 Interrupt" index="169" name="QEI1" />
         <interrupt caption="QEI 2 Interrupt" index="170" name="QEI2" />
         <interrupt caption="PWM Primary Event" index="171" name="PWM_PRI" />
         <interrupt caption="PWM Secondary Event" index="172" name="PWM_SEC" />
         <interrupt caption="PWM 1 Interrupt" index="173" name="PWM1" />
         <interrupt caption="PWM 2 Interrupt" index="174" name="PWM2" />
         <interrupt caption="PWM 3 Interrupt" index="175" name="PWM3" />
         <interrupt caption="PWM 4 Interrupt" index="176" name="PWM4" />
         <interrupt caption="PWM 5 Interrupt" index="177" name="PWM5" />
         <interrupt caption="PWM 6 Interrupt" index="178" name="PWM6" />
         <interrupt caption="DMA Channel 4" index="182" name="DMA4" />
         <interrupt caption="DMA Channel 5" index="183" name="DMA5" />
         <interrupt caption="DMA Channel 6" index="184" name="DMA6" />
         <interrupt caption="DMA Channel 7" index="185" name="DMA7" />
         <interrupt caption="QEI 3 Interrupt" index="189" name="QEI3" />
         <interrupt caption="System Bus Protection Violation" index="230" name="SYSTEM_BUS_PROTECTION" />
         <interrupt caption="PWM 7 Interrupt" index="238" name="PWM7" />
         <interrupt caption="PWM 8 Interrupt" index="239" name="PWM8" />
         <interrupt caption="PWM 9 Interrupt" index="240" name="PWM9" />
         <interrupt caption="ADC Digital Comparator 3" index="245" name="ADC_DC3" />
         <interrupt caption="ADC Digital Comparator 4" index="246" name="ADC_DC4" />
         <interrupt caption="P - Cache Event Interrupt" index="247" name="PCACHE" />
         <interrupt caption="CLC 1 Interrupt" index="249" name="CLC1" />
         <interrupt caption="CLC 2 Interrupt" index="250" name="CLC2" />
         <interrupt caption="CLC 3 Interrupt" index="251" name="CLC3" />
         <interrupt caption="CLC 4 Interrupt" index="252" name="CLC4" />
         <interrupt caption="MPU Core Performance Counter Event" index="254" name="CORE_PERF_COUNT" />
         <interrupt caption="Core Fast Debug Channel" index="255" name="CORE_FAST_DEBUG_CHAN" />
      </interrupts>
      <interfaces>
         <interface name="JTAG" type="samjtag" />
         <interface name="SWD" type="swd" />
      </interfaces>
   </device>
</devices>
<modules>
   <module caption="" id="" name="FUSECONFIG" version="">
      <register-group name="FUSECONFIG">
         <register caption="Device Configuration Word 3" initval="0xFFFFFFFF" name="DEVCFG3">
            <bitfield caption="Peripheral Pin Select Configuration bit" mask="0x20000000" name="IOL1WAY" values="DEVCFG3__IOL1WAY" />
            <bitfield caption="Peripheral Module Disable Configuration bit" mask="0x10000000" name="PMDL1WAY" values="DEVCFG3__PMDL1WAY" />
            <bitfield caption="Permission Group Lock One Way Configuration bit" mask="0x8000000" name="PGL1WAY" values="DEVCFG3__PGL1WAY" />
            <bitfield caption="PWM Write Access Select bit" mask="0x100000" name="PWMLOCK" values="DEVCFG3__PWMLOCK" />
            <bitfield caption="UserID" mask="0xffff" name="USERID" values="DEVCFG3__USERID" />
         </register>
