Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH064.atdf
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ21__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ21__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK21__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK21__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ22__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ22__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK22__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK22__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ23__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ23__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK23__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK23__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ24__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ24__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK24__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK24__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ25__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ25__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK25__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK25__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ26__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
