Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH064.atdf
         <register caption="DMA Channel x Source Start Address Register" name="DCH7SSA" offset="0x5d0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHSSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH0DSA" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHDSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH1DSA" offset="0x160" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHDSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH2DSA" offset="0x220" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHDSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH3DSA" offset="0x2e0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHDSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH4DSA" offset="0x3a0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHDSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH5DSA" offset="0x460" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHDSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH6DSA" offset="0x520" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHDSA" />
         </register>
         <register caption="DMA Channel x Destination Start Address Register" name="DCH7DSA" offset="0x5e0" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHDSA" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH0SSIZ" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH0SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH1SSIZ" offset="0x170" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH1SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH2SSIZ" offset="0x230" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH2SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH3SSIZ" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH3SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH4SSIZ" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH4SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH5SSIZ" offset="0x470" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH5SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH6SSIZ" offset="0x530" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH6SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Source Size Register" name="DCH7SSIZ" offset="0x5f0" rw="RW" size="4">
            <bitfield caption="Channel Source Size bits" mask="0x0000FFFF" name="CHSSIZ" values="DCH7SSIZ__CHSSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH0DSIZ" offset="0xc0" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH0DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH1DSIZ" offset="0x180" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH1DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH2DSIZ" offset="0x240" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH2DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH3DSIZ" offset="0x300" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH3DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH4DSIZ" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH4DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH5DSIZ" offset="0x480" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH5DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH6DSIZ" offset="0x540" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH6DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Destination Size Register" name="DCH7DSIZ" offset="0x600" rw="RW" size="4">
            <bitfield caption="Channel Destination Size bits" mask="0x0000FFFF" name="CHDSIZ" values="DCH7DSIZ__CHDSIZ" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH0SPTR" offset="0xd0" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH0SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH1SPTR" offset="0x190" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH1SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH2SPTR" offset="0x250" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH2SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH3SPTR" offset="0x310" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH3SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH4SPTR" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH4SPTR__CHSPTR" />
         </register>
         <register caption="DMA Channel x Source Pointer Register" name="DCH5SPTR" offset="0x490" rw="RW" size="4">
            <bitfield caption="Channel Source Pointer bits" mask="0x0000FFFF" name="CHSPTR" values="DCH5SPTR__CHSPTR" />
         </register>
