Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH064.atdf
         <register caption="Interrupt Priority Control Register" name="IPC17" offset="0x250" size="4">
            <bitfield mask="0x03000000" name="CTMUIS" />
            <bitfield mask="0x1C000000" name="CTMUIP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC18" offset="0x260" size="4">
            <bitfield mask="0x00000003" name="DMA0IS" />
            <bitfield mask="0x0000001C" name="DMA0IP" />
            <bitfield mask="0x00000300" name="DMA1IS" />
            <bitfield mask="0x00001C00" name="DMA1IP" />
            <bitfield mask="0x00030000" name="DMA2IS" />
            <bitfield mask="0x001C0000" name="DMA2IP" />
            <bitfield mask="0x03000000" name="DMA3IS" />
            <bitfield mask="0x1C000000" name="DMA3IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC19" offset="0x270" size="4">
            <bitfield mask="0x00000003" name="T6IS" />
            <bitfield mask="0x0000001C" name="T6IP" />
            <bitfield mask="0x00000300" name="IC6EIS" />
            <bitfield mask="0x00001C00" name="IC6EIP" />
            <bitfield mask="0x00030000" name="IC6IS" />
            <bitfield mask="0x001C0000" name="IC6IP" />
            <bitfield mask="0x03000000" name="OC6IS" />
            <bitfield mask="0x1C000000" name="OC6IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC20" offset="0x280" size="4">
            <bitfield mask="0x00000003" name="T7IS" />
            <bitfield mask="0x0000001C" name="T7IP" />
            <bitfield mask="0x00000300" name="IC7EIS" />
            <bitfield mask="0x00001C00" name="IC7EIP" />
            <bitfield mask="0x00030000" name="IC7IS" />
            <bitfield mask="0x001C0000" name="IC7IP" />
            <bitfield mask="0x03000000" name="OC7IS" />
            <bitfield mask="0x1C000000" name="OC7IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC21" offset="0x290" size="4">
            <bitfield mask="0x00000003" name="T8IS" />
            <bitfield mask="0x0000001C" name="T8IP" />
            <bitfield mask="0x00000300" name="IC8EIS" />
            <bitfield mask="0x00001C00" name="IC8EIP" />
            <bitfield mask="0x00030000" name="IC8IS" />
            <bitfield mask="0x001C0000" name="IC8IP" />
            <bitfield mask="0x03000000" name="OC8IS" />
            <bitfield mask="0x1C000000" name="OC8IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC22" offset="0x2a0" size="4">
            <bitfield mask="0x00000003" name="T9IS" />
            <bitfield mask="0x0000001C" name="T9IP" />
            <bitfield mask="0x00000300" name="IC9EIS" />
            <bitfield mask="0x00001C00" name="IC9EIP" />
            <bitfield mask="0x00030000" name="IC9IS" />
            <bitfield mask="0x001C0000" name="IC9IP" />
            <bitfield mask="0x03000000" name="OC9IS" />
            <bitfield mask="0x1C000000" name="OC9IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC23" offset="0x2b0" size="4">
            <bitfield mask="0x00000003" name="AD1IS" />
            <bitfield mask="0x0000001C" name="AD1IP" />
            <bitfield mask="0x00030000" name="AD1DC1IS" />
            <bitfield mask="0x001C0000" name="AD1DC1IP" />
            <bitfield mask="0x03000000" name="AD1DC2IS" />
            <bitfield mask="0x1C000000" name="AD1DC2IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC24" offset="0x2c0" size="4">
            <bitfield mask="0x00000003" name="AD1DF1IS" />
            <bitfield mask="0x0000001C" name="AD1DF1IP" />
            <bitfield mask="0x00000300" name="AD1DF2IS" />
            <bitfield mask="0x00001C00" name="AD1DF2IP" />
            <bitfield mask="0x00030000" name="AD1DF3IS" />
            <bitfield mask="0x001C0000" name="AD1DF3IP" />
            <bitfield mask="0x03000000" name="AD1DF4IS" />
            <bitfield mask="0x1C000000" name="AD1DF4IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC25" offset="0x2d0" size="4">
            <bitfield mask="0x00000003" name="AD1F1IS" />
            <bitfield mask="0x0000001C" name="AD1F1IP" />
            <bitfield mask="0x00000300" name="AD1EOSIS" />
            <bitfield mask="0x00001C00" name="AD1EOSIP" />
            <bitfield mask="0x00030000" name="AD1ARIS" />
            <bitfield mask="0x001C0000" name="AD1ARIP" />
            <bitfield mask="0x03000000" name="AD1RSIS" />
            <bitfield mask="0x1C000000" name="AD1RSIP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC26" offset="0x2e0" size="4">
            <bitfield mask="0x00000003" name="AD1FCBTIS" />
            <bitfield mask="0x0000001C" name="AD1FCBTIP" />
            <bitfield mask="0x00000300" name="AD1G1IS" />
            <bitfield mask="0x00001C00" name="AD1G1IP" />
            <bitfield mask="0x00030000" name="AD1D0IS" />
            <bitfield mask="0x001C0000" name="AD1D0IP" />
            <bitfield mask="0x03000000" name="AD1D1IS" />
            <bitfield mask="0x1C000000" name="AD1D1IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC27" offset="0x2f0" size="4">
            <bitfield mask="0x00000003" name="AD1D2IS" />
            <bitfield mask="0x0000001C" name="AD1D2IP" />
            <bitfield mask="0x00000300" name="AD1D3IS" />
            <bitfield mask="0x00001C00" name="AD1D3IP" />
            <bitfield mask="0x00030000" name="AD1D4IS" />
            <bitfield mask="0x001C0000" name="AD1D4IP" />
            <bitfield mask="0x03000000" name="AD1D5IS" />
            <bitfield mask="0x1C000000" name="AD1D5IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC28" offset="0x300" size="4">
            <bitfield mask="0x00000003" name="AD1D6IS" />
            <bitfield mask="0x0000001C" name="AD1D6IP" />
            <bitfield mask="0x00000300" name="AD1D7IS" />
            <bitfield mask="0x00001C00" name="AD1D7IP" />
            <bitfield mask="0x00030000" name="AD1D8IS" />
            <bitfield mask="0x001C0000" name="AD1D8IP" />
            <bitfield mask="0x03000000" name="AD1D9IS" />
            <bitfield mask="0x1C000000" name="AD1D9IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC29" offset="0x310" size="4">
            <bitfield mask="0x00000003" name="AD1D10IS" />
            <bitfield mask="0x0000001C" name="AD1D10IP" />
            <bitfield mask="0x00000300" name="AD1D11IS" />
            <bitfield mask="0x00001C00" name="AD1D11IP" />
            <bitfield mask="0x00030000" name="AD1D12IS" />
            <bitfield mask="0x001C0000" name="AD1D12IP" />
            <bitfield mask="0x03000000" name="AD1D13IS" />
            <bitfield mask="0x1C000000" name="AD1D13IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC30" offset="0x320" size="4">
            <bitfield mask="0x00000003" name="AD1D14IS" />
            <bitfield mask="0x0000001C" name="AD1D14IP" />
            <bitfield mask="0x00000300" name="AD1D15IS" />
            <bitfield mask="0x00001C00" name="AD1D15IP" />
            <bitfield mask="0x00030000" name="AD1D16IS" />
            <bitfield mask="0x001C0000" name="AD1D16IP" />
            <bitfield mask="0x03000000" name="AD1D17IS" />
            <bitfield mask="0x1C000000" name="AD1D17IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC31" offset="0x330" size="4">
            <bitfield mask="0x00000003" name="AD1D18IS" />
            <bitfield mask="0x0000001C" name="AD1D18IP" />
            <bitfield mask="0x00000300" name="AD1D19IS" />
            <bitfield mask="0x00001C00" name="AD1D19IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC32" offset="0x340" size="4">
            <bitfield mask="0x00030000" name="AD1D24IS" />
            <bitfield mask="0x001C0000" name="AD1D24IP" />
            <bitfield mask="0x03000000" name="AD1D25IS" />
            <bitfield mask="0x1C000000" name="AD1D25IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC33" offset="0x350" size="4">
            <bitfield mask="0x00000003" name="AD1D26IS" />
            <bitfield mask="0x0000001C" name="AD1D26IP" />
            <bitfield mask="0x00000300" name="AD1D27IS" />
            <bitfield mask="0x00001C00" name="AD1D27IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC34" offset="0x360" size="4" />
         <register caption="Interrupt Priority Control Register" name="IPC36" offset="0x380" size="4">
            <bitfield mask="0x00030000" name="AD1D40IS" />
            <bitfield mask="0x001C0000" name="AD1D40IP" />
            <bitfield mask="0x03000000" name="AD1D41IS" />
            <bitfield mask="0x1C000000" name="AD1D41IP" />
         </register>
         <register caption="Interrupt Priority Control Register" name="IPC38" offset="0x3a0" size="4">
            <bitfield mask="0x00000003" name="AD1D46IS" />
            <bitfield mask="0x0000001C" name="AD1D46IP" />
            <bitfield mask="0x00000300" name="AD1D47IS" />
            <bitfield mask="0x00001C00" name="AD1D47IP" />
            <bitfield mask="0x00030000" name="AD1D48IS" />
            <bitfield mask="0x001C0000" name="AD1D48IP" />
            <bitfield mask="0x03000000" name="AD1D49IS" />
            <bitfield mask="0x1C000000" name="AD1D49IP" />
         </register>
