Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH064.atdf
         <register caption="" name="OFF059" offset="0x62C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF060" offset="0x630" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF061" offset="0x634" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF071" offset="0x65C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF072" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF073" offset="0x664" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF074" offset="0x668" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF075" offset="0x66C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF076" offset="0x670" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF077" offset="0x674" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF078" offset="0x678" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF079" offset="0x67C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF080" offset="0x680" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF081" offset="0x684" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF082" offset="0x688" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF083" offset="0x68C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF084" offset="0x690" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF085" offset="0x694" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF086" offset="0x698" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF087" offset="0x69C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF088" offset="0x6A0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF089" offset="0x6A4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF090" offset="0x6A8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF091" offset="0x6AC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF092" offset="0x6B0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF094" offset="0x6B8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF095" offset="0x6BC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF096" offset="0x6C0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF097" offset="0x6C4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF098" offset="0x6C8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF099" offset="0x6CC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF100" offset="0x6D0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF101" offset="0x6D4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF102" offset="0x6D8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF103" offset="0x6DC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF104" offset="0x6E0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF105" offset="0x6E4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF106" offset="0x6E8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF107" offset="0x6EC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF108" offset="0x584" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
