Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.2.87/atdf/PIC32MK0256GPH064.atdf
         <register caption="" name="IC1R" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC1R" />
         </register>
         <register caption="" name="IC2R" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC2R" />
         </register>
         <register caption="" name="IC3R" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC3R" />
         </register>
         <register caption="" name="IC4R" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC4R" />
         </register>
         <register caption="" name="IC5R" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC5R" />
         </register>
         <register caption="" name="IC6R" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC6R" />
         </register>
         <register caption="" name="IC7R" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC7R" />
         </register>
         <register caption="" name="IC8R" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC8R" />
         </register>
         <register caption="" name="IC9R" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC9R" />
         </register>
         <register caption="" name="OCFAR" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFAR" />
         </register>
         <register caption="" name="OCFBR" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="OCFBR" />
         </register>
         <register caption="" name="U1RXR" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1RXR" />
         </register>
         <register caption="" name="U1CTSR" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U1CTSR" />
         </register>
         <register caption="" name="U2RXR" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2RXR" />
         </register>
         <register caption="" name="U2CTSR" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U2CTSR" />
         </register>
         <register caption="" name="U3RXR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3RXR" />
         </register>
         <register caption="" name="U3CTSR" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U3CTSR" />
         </register>
         <register caption="" name="U4RXR" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4RXR" />
         </register>
         <register caption="" name="U4CTSR" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U4CTSR" />
         </register>
         <register caption="" name="U5RXR" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5RXR" />
         </register>
         <register caption="" name="U5CTSR" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U5CTSR" />
         </register>
         <register caption="" name="U6RXR" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U6RXR" />
         </register>
         <register caption="" name="U6CTSR" offset="0x8c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="U6CTSR" />
         </register>
         <register caption="" name="SDI1R" offset="0x94" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI1R" />
         </register>
         <register caption="" name="SS1R" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS1R" />
         </register>
         <register caption="" name="SDI2R" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI2R" />
         </register>
         <register caption="" name="SS2R" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS2R" />
         </register>
         <register caption="" name="SCK3R" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SCK3R" />
         </register>
         <register caption="" name="SDI3R" offset="0xac" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI3R" />
         </register>
         <register caption="" name="SS3R" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS3R" />
         </register>
         <register caption="" name="SCK4R" offset="0xb4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SCK4R" />
         </register>
         <register caption="" name="SDI4R" offset="0xb8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI4R" />
         </register>
         <register caption="" name="SS4R" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS4R" />
         </register>
         <register caption="" name="C1RXR" offset="0xc0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C1RXR" />
         </register>
         <register caption="" name="C2RXR" offset="0xc4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C2RXR" />
         </register>
         <register caption="" name="REFIR" offset="0xc8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="REFIR" />
         </register>
         <register caption="" name="QEA1R" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEA1R" />
         </register>
         <register caption="" name="QEB1R" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEB1R" />
         </register>
         <register caption="" name="INDX1R" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INDX1R" />
         </register>
         <register caption="" name="HOME1R" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="HOME1R" />
         </register>
         <register caption="" name="QEA2R" offset="0xdc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEA2R" />
         </register>
         <register caption="" name="QEB2R" offset="0xe0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEB2R" />
         </register>
         <register caption="" name="INDX2R" offset="0xe4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INDX2R" />
         </register>
         <register caption="" name="HOME2R" offset="0xe8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="HOME2R" />
         </register>
         <register caption="" name="FLT1R" offset="0xec" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="FLT1R" />
         </register>
